#Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N

N = int(input("write a number: "))
mas = list(range(-N, N+1))
print(mas)

