#2.Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#[2, 3, 4, 5, 6] => [12, 15, 16];
#[2, 3, 5, 6] => [12, 15]

a = [7, 1, 15, 3, 4]
b = 0
c = 0
d = 0
for i in range(len(a)):
    b = a[0] * a[4]
    c = a[1] * a[3]
    d = a[2] * a[2]
k = [b, c, d]
print(k)